import React from 'react';
import Book from './book'; 
import Harrypotterimg from '../assets/harrypotter.jpg';
import jinsebisTaoba from '../assets/jinsebis-taoba.jpg';
import cnobiliXuteuli from '../assets/cnobili-xuteuli.jpg';
import mzeMtvare from '../assets/mze-mtvare-da-puris-yana.jpg';
import wvavisYana from '../assets/wvavis-yana.jpg';

const books = [
    {index:1, characters:'ჰარი პოტერი, ჰერმიონ გრეინჯერი, რონ უისლი, ალბუს დამბულდორი...', image:Harrypotterimg, title:'ჰარი პოტერი', desc:'ჰარი პოტერის ცხოვრებას ჯადოსნურს ნამდვილად ვერ უწოდებ; ბიჭი სამოწყალოდ ცხოვრობს დერსლებთან - დეიდასთან, ბიძასთან და საძაგელ დეიდაშვილთან. მისი ოთახი კიბის ქვეშ მდებარე პაწაწინა საწყობია, დაბადების დღისთვის კი განსაკუთრებულ საჩუქარს არ ელოდება. მაგრამ სწორედ მე-11 დაბადების დღეზე ჰარი ბუს ფოსტით იდუმალ წერილს იღებს: წერილს, რომელიც დაუჯერებელ ადგილას - ჰოგვორტსის მაგიისა და და ჯადოქრობის სკოლაში - სასწავლებლად იწვევს. ჰარი მოულოდნელად საოცარ მაგიურ გარემოში აღმოჩნდება. ჯადოქრულ სამყაროში ყველამ იცის, რომ ჰარი რჩეულია - უდიდესი ჯადოქრის სასიკვდილო წყევლას გადარჩენილ ბიჭს დიადი საქმეები ელის წინ.'},
    {index:2, characters:'გეგა კობახიძე, თინა ფეტვიაშვილი, სოსო წერეთელი, გია ტაბიძე... ', image:jinsebisTaoba, title:'ჯინსების თაობა', desc:'1983 წელს რამდენიმე ქართველმა ახალგაზრდამ საბჭოთა საქართველოდან თვითმფრინავის გატაცება და ამ გზით ამერიკაში მოხვედრა სცადა. გულუბრყვილო მცდელობა წარუმატებელი აღმოჩნდა, რომელსაც  მსხვერპლიც მოჰყვა თვითმფრინავის ეკიპაჟის წევრებსა და მგზავრებს შორის. დაიღუპნენ გამტაცებლებიც, მათი უმეტესობა კი სასამართლოს წინაშე წარსდგა.'},
    {index:3, characters:'ჯულიენი, დიკი, ენი, ჯორჯი, ტიმი...', image:cnobiliXuteuli, title:'ცნობილი ხუთეული', desc:'ჯულიენი, დიკი, ენი, ჯორჯი და ტიმი – ცნობილი ხუთეული ახალი თავგადასავლის მონაწილე ხდება! მეგობრები ისევ კირინის კოტეჯში იკრიბებიან და საშობაო არდადეგებს ერთად ატარებენ, თუმცა ამჯერად არც ელიან, რომ რაიმე საინტერესო გადახდებათ თავს – ზამთრობით ხომ ზღვა მუდმივად აღელვებულია და კირინის კუნძულზე გამგზავრ...'},
    {index:4, characters:'ჯუდე, მანუშკა, ხაიმა...', image:mzeMtvare, title:'მზე მთვარე და პურის ყანა', desc:'ძალიან რთულია, დაამტკიცო შენი უდანაშაულობა, როცა კრიმინალები მოკვლით გემუქრებიან, პროკურატურისთვის მთავარია, საქმე გახსნილად გამოაცხადოს, „გამოვლენილი დამნაშავე“ გააციმბიროს ან თუნდაც დახვრიტოს. კიდევ უფრო რთულია, ნახევარი ცხოვრება სხვის მიერ ჩადენილი დანაშაულის გამო გაატარო ციხეში, სადაც შეიძლება ჭლექმა მოგიღოს ბოლო, თუ ვინმეს თვალში არ მოუხვედი, სიცოცხლეს გამოგასალმოს ან სულაც უბრალოდ ჭკუიდან შეიშალო. დიახ, რთულია. თუმცა ამ ყველაფრის გაძლება და მასთან ბრძოლაც კი შეიძლება, როცა იცი, რომ შენს დაბრუნებას ვიღაც, თუნდაც მხოლოდ ერთი ადამიანი ელოდება. ცნობილი ქართველი რეჟისორის, თემურ ბაბლუანის „მზე, მთვარე და პურის ყანა (მანუშაკა მელოდება)“ სათავგადასავლო რომანია, რომელშიც აღწერილი ერთი თბილისელი ბიჭის დარდითა და ტკივილით სავსე ცხოვრების ამბავი ერთი ამოსუნთქვით იკითხება.'},
    {index:5, characters:'ჰოლდენ კოლფილდი...', image:wvavisYana, title:'თამაში ჭვავის ყანაში', desc:'ჰოლდენი ამბობს : „წიგნი ისეთი უნდა იყოს რო წაიკითხავ უნდა მოგინდეს რო მისი დამწერი შენი გადაბმული ძმაკაცი იყოს, აი ისეთი რო დაურეკავ და ნებისმიერ რამეზე ებაზრები, თუნდაც შუაღამისას …” ამ წიგნის წაკითხვის შემდეგ კი ნამდვილად გვიჩნდება სურვილი ჯერომ სელინჯერის ახლოს გაცნობისა.'}
]

const Books = () => {
    function logs(mainCharacters) {
       console.log(mainCharacters);
    }
    
    return (
        <div>
           {books.map((book) => <Book 
           key={book.index}
           characters={book.characters}
           image={book.image} 
           title={book.title} 
           desc={book.desc}
           log={() => logs(book.characters)}
          
           />)}
        </div>
    );
}

export default Books;

