// Book.js
import React from 'react';

// Book კომპონენტი წარმოადგენს ერთი წიგნის ინფორმაციას
const Book = (props) => {
    return (
        <div>
            {/* რენდერს ხდება გამოსახულება props.image-დან */}
            <img src={props.image} alt="" />
            <h1>Harry Potter</h1>
            <p>ჰარი პოტერის ცხოვრებას ჯადოსნურს ნამდვილად ვერ უწოდებ; ბიჭი სამოწყალოდ ცხოვრობს დერსლებთან - დეიდასთან, ბიძასთან და საძაგელ დეიდაშვილთან. მისი ოთახი კიბის ქვეშ მდებარე პაწაწინა საწყობია, დაბადების დღისთვის კი განსაკუთრებულ საჩუქარს არ ელოდება. მაგრამ სწორედ მე-11 დაბადების დღეზე ჰარი ბუს ფოსტით იდუმალ წერილს იღებს: წერილს, რომელიც დაუჯერებელ ადგილას - ჰოგვორტსის მაგიისა და და ჯადოქრობის სკოლაში - სასწავლებლად იწვევს. ჰარი მოულოდნელად საოცარ მაგიურ გარემოში აღმოჩნდება. ჯადოქრულ სამყაროში ყველამ იცის, რომ ჰარი რჩეულია - უდიდესი ჯადოქრის სასიკვდილო წყევლას გადარჩენილ ბიჭს დიადი საქმეები ელის წინ.</p>
        </div>
    );
}

export default Book;